---
type: PipeFittingAndAccessoryPressureDropData
namespace: Autodesk.Revit.DB.Plumbing
version: 2024
members: 7
tags: [revit-api, class]
---

# PipeFittingAndAccessoryPressureDropData

`Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetPipeFittingAndAccessoryData | 2014 | `public PipeFittingAndAccessoryData GetPipeFittingAndAccessoryData ()` |
| Method | GetPresureDropItems | 2014 | `public IList < PipeFittingAndAccessoryPressureDropItem > GetPresureDropItems ()` |
| Method | SetDefaultEntity | 2014 | `public void SetDefaultEntity ( Entity defaultEntity )` |
| Property | CalculationType | 2014 | `public int CalculationType { get ; }` |
| Property | IsCurrentEntityValid | 2017 | `public bool IsCurrentEntityValid { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |